'use client'
import gsap from 'gsap'
import { useGSAP } from '@gsap/react'
import { useRef } from 'react'
import ScrollTrigger from 'gsap/ScrollTrigger';

const FaqQuestion = () => {
  const faqQuestionScoop = useRef()
  gsap.registerPlugin(ScrollTrigger)
  useGSAP(() => {
    gsap.to('.box', {
      scrollTrigger : {
        trigger : '.box',
        start : 'top center'
      },
      duration : 1,
      opacity : 1,
      stagger : .3
    })
  },[])
  return (
    <>
    <div className="frequent-question" ref={faqQuestionScoop}>
        <div className="container">
            <div className="box" id='firstFAQ'>
                <h3>ماهي المدرسة الحكومية الالكترونية ؟</h3>
                <p>المدرسة الحكومية الألكترونية هي مدرسة افتراضية أنشأت من قبل وزارة التربية العراقية وفقا لنظام المدارس الأبتدائية رقم (30) لسنة 1978 ونظام المدارس الثانوية رقم (2) لسنة 1977 بأستثناء تعليمات الأبنية المدرسية والتعليمات الحضورية.</p>
            </div>
            <div className="box">
                <h3>ما الغرض من المدرسة الحكومية الالكترونية ؟</h3>
                <p>توفير بيئة إلكترونية للتواصل بين المتعلمين والمحاضرين، وتقدم برامج تعليم عن بعد متميزة عالية الجودة.</p>
            </div>
            <div className="box">
                <h3>من هي الفئة المستهدفة من قبل المدرسة الحكومية الالكترونية ؟</h3>
                <p>تستهدف المدرسة المتقدمين لنظام الأنتساب الذين تنطبق عليهم الضوابط والتعليمات ولجميع المراحل الدراسية الأبتدائية والمتوسطة والأعدادية وبجميع فروعها.</p>
            </div>
            <div className="box">
                <h3>هل هناك رسوم مقابل استخدام المنصة الالكترونية؟</h3>
                <p>نعم هناك رسوم مقرة من قبل الوزارة حسب الفئة المستهدفة (الأنتساب) وسيتم الإعلان عنها خلال الأيام القادمة</p>
            </div>
            <div className="box">
                <h3>ماهي شروط التسجيل لطلبة الانتساب في المدرسة الحكومية الالكترونية؟</h3>
                <p>يرجى زيارة الموقع الرسمي الخاص بالمدرسة الحكومية الالكترونية والاطلاع على الشروط الخاصة لطلبة الانتساب المقرة من قبل الوزارة</p>
            </div>
            <div className="box">
                <h3>ما هي الخدمات المتاحة في المدرسة الحكومية الالكترونية ؟</h3>
                <p>1- دروس منهجية فيديوية تفاعلية  2- واجبات مدرسية 3- امتحانات يومية وشهرية 4- التواصل مغ الكادر التدريسي 5- متابعة الحضور والغياب 6- تقدم مستوى الطالب</p>
            </div>
            <div className="box">
                <h3>هل يمكنني تتبع تقدمي وأدائي ومعرفة درجاتي؟</h3>
                <p>نعم يمكنك ذلك.</p>
            </div>
            <div className="box">
                <h3>هل يمكنني الوصول إلى المواد الدراسية والتعلم في أي وقت ومن أي مكان؟</h3>
                <p>نعم يمكن ذلك.</p>
            </div>
            <div className="box">
                <h3>هل يمكنني تقديم الاختبارات والواجبات عبر المدرسة الحكومية الالكترونية ؟</h3>
                <p>نعم يمكن ذلك.</p>
            </div>
            <div className="box">
                <h3>هل يوجد جدول معين يتم اتباعه في المدرسة الحكومية الالكترونية ؟</h3>
                <p>نعم يوجد جدول لنشر المحاضرات المنهجية يتم تحديده من قبل إدارة المدرسة الحكومية الالكترونية.</p>
            </div>
            <div className="box">
                <h3>هل يتم توفير محتوى تعليمي متنوع للتناسب مع احتياجات الطلبة من مختلف المستويات والقدرات؟</h3>
                <p>يتوفر حالياً محتوى وزاري منهجي يتناسب مع الفئات المستهدفة وبالامكان توسيع الفئات مستقبلاً.</p>
            </div>
            <div className="box">
                <h3>هل توفر المدرسة الحكومية الالكترونية مواد إضافية للتحضير للاختبارات النهائية؟</h3>
                <p>نعم توفر ذلك.</p>
            </div>
        </div>
    </div>
    </>
  )
}

export default FaqQuestion
