
import Title from "@/components/Title"
import TopSection from "@/components/TopSection"
import Header from "@/components/Header"
import Footer from "@/components/Footer"

export default function Terms () {
    return (
        <>
        <Header/>
            <div className="terms">
                <div className="container">
                    <div className="terms-container">
                        <div className="terms-ruls">
                            <Title>الشروط والاحكام</Title>
                            <p className="terms-para">يهدف تطبيق المدرسة الحكومية الألكترونية توفير بيئة تعليمية افتراضية شاملة تشجع على حب المعرفة والتعلم وتنمية مهارات المستخدمين المسجلين في هذا التطبيق ، وذلك من خلال تقديم محتوى تعليمي شامل لجميع المناهج المقررة من قبل وزارة التربية العراقية. حيث تستهدف المدرسة المتقدمين لنظام الخارجي وطلبة نظام الأنتساب الذين تنطبق عليهم الضوابط والتعليمات ولجميع المراحل الدراسية الأبتدائية والمتوسطة والأعدادية وبجميع فروعها.
                                عزيزي المستخدم بتسجيلك واستخدامك لتطبيق المدرسة الحكومية الألكترونية فأنت تقر على موافقتك الكاملة على هذه الشروط .</p>
                            <ul className="terms-list">
                                <li>1. صحة المعلومات التي يزودها المستخدم
                                يضمن المستخدم ان جميع المعلومات التي يقوم بأدخالها وجميع الوثائق التي يقوم برفعها من خلال حسابه في تطبيق
                                المدرسة الحكومية الألكترونية صحيحة تماما.</li>
                                <li>2. عدم انشاء اكثر من حساب
                                يلتزم المستخدم بعدم انشاء اكثر من حساب واحد في تطبيق المدرسة الحكومية الألكترونية، وفي حال واجه مشكلة في
                                حسابه الأول فعليه المتابعة مع فريق الدعم الفني لحل المشكلة .</li>
                                <li>3. أستخدام اكثر من شخص للحساب في تطبيق المدرسة الحكومية الألكترونية
                                يتعهد المستخدم المسجل في تطبيق المدرسة الحكومية الألكترونية انه الوحيد الذي يستخدم الحساب ويكون مسؤلا عن كل
                                ما يتم عبر حسابه، ولا يسمح اكثر من شخص بأستخدام حساب واحد في تطبيق المدرسة الحكومية الألكترونية.</li>
                                <li>4. <a className="terms-link" href="https://next-js-main-ta3leem.vercel.app/ruls">ضوابط وتعليمات التسجيل</a> في المدرسة الحكومية الألكترونية
                                يقر المستخدم المسجل في تطبيق المدرسة الحكومية الألكترونية بأطلاعه على جميع ضوابط وتعليمات التسجيل في المدرسة الحكومية الألكترونية.</li>
                                <li>5. لا يحق للطالب استرداد رسوم التسجيل :
                                بعد ان يتم الموافقة على طلبه بالتسجيل والانضمام الى المدرسة الحمكومية الالكترونية, لا يحق للطالب استرداد رسوم التسجيل .</li>
                            </ul>
                            <p className="terms-second-para">المخالفات :
                            في حال قام المستخدم المسجل في تطبيق المدرسة الحكومية الألكترونية بمخالفة اي من الشروط والأحكام الواردة اعلاه فأنه سيتحمل المسؤولية الكاملة عن الغاء تسجيله في المدرسة الحكومية الألكترونية، ولا يحق له استرداد المبلغ المدفوع كرسوم تسجيل في هذه المدرسة .</p>
                        </div>
                    </div>
                </div>
            </div>
            <Footer/>
        </>
    )
}